gmsh-4.10.4-Windows64/2D_airfoil/airfoil/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    front
    {
        type            empty;
        physicalType    patch;
        nFaces          28898;
        startFace       43042;
    }
    exit
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       71940;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       71990;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       72040;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       72090;
    }
    aerofoil
    {
        type            wall;
        physicalType    patch;
        nFaces          410;
        startFace       72140;
    }
    back
    {
        type            empty;
        physicalType    patch;
        nFaces          28898;
        startFace       72550;
    }
)

// ************************************************************************* //
