gmsh-4.10.4-Windows64/2D_airfoil/airfoil/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

runApplication $application

#------------------------------------------------------------------------------
